Информационная_база/src/Documents/ПроводкиМесяца/ПроводкиМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроводкиМесяца</name>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
  <attributes>
    <name>Прибыль</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Информационная_база/src/AccountingRegisters/РегистрБухгалтерии/РегистрБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухгалтерии</name>
  <chartOfAccounts>ChartOfAccounts.БухУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Информационная_база/src/Documents/ПроводкиМесяца/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Проводка = Движения.РегистрБухгалтерии.Добавить();
	Проводка.Период = КонецМесяца(ЭтотОбъект.Дата);
	Проводка.СчетДт = ПланыСчетов.БухУчет.Прибыль;
	Проводка.Сумма = ЭтотОбъект.Прибыль;
	
	 Движения.РегистрБухгалтерии.Записывать = Истина;
КонецПроцедуры
